venkatarajasekhar/nRF5_SDK/external/nimble/drivers/nrf51/src/ble_phy.c
/**
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <stdint.h>
#include <string.h>
#include <assert.h>
#include "os/os.h"
#include "bsp/cmsis_nvic.h"
#include "nimble/ble.h"
#include "nimble/nimble_opt.h"
#include "controller/ble_phy.h"
#include "controller/ble_ll.h"
#include "mcu/nrf51_bitfields.h"

/* XXX: 4) Make sure RF is higher priority interrupt than schedule */

/*
 * XXX: Maximum possible transmit time is 1 msec for a 60ppm crystal
 * and 16ms for a 30ppm crystal! We need to limit PDU size based on
 * crystal accuracy. Look at this in the spec.
 */

/* XXX: private header file? */
extern uint8_t g_nrf_num_irks;
extern uint32_t g_nrf_irk_list[];

/* To disable all radio interrupts */
#define NRF_RADIO_IRQ_MASK_ALL  ((RADIO_INTENCLR_READY_Clear << RADIO_INTENCLR_READY_Pos)       | \
                                 (RADIO_INTENCLR_ADDRESS_Clear << RADIO_INTENCLR_ADDRESS_Pos)   | \
                                 (RADIO_INTENCLR_PAYLOAD_Clear << RADIO_INTENCLR_PAYLOAD_Pos)   | \
                                 (RADIO_INTENCLR_END_Clear << RADIO_INTENCLR_END_Pos)           | \
                                 (RADIO_INTENCLR_DISABLED_Clear << RADIO_INTENCLR_DISABLED_Pos) | \
                                 (RADIO_INTENCLR_DEVMATCH_Clear << RADIO_INTENCLR_DEVMATCH_Pos) | \
                                 (RADIO_INTENCLR_DEVMISS_Clear << RADIO_INTENCLR_DEVMISS_Pos)   | \
                                 (RADIO_INTENCLR_RSSIEND_Clear << RADIO_INTENCLR_RSSIEND_Pos)   | \
                                 (RADIO_INTENCLR_BCMATCH_Clear << RADIO_INTENCLR_BCMATCH_Pos))

/* To enable all radio shorts */
#define NRF_RADIO_SHORTS_Enabled ((RADIO_SHORTS_READY_START_Enabled << RADIO_SHORTS_READY_START_Pos)            | \
                                 (RADIO_SHORTS_END_DISABLE_Enabled << RADIO_SHORTS_END_DISABLE_Pos)             | \
                                 (RADIO_SHORTS_DISABLED_TXEN_Enabled << RADIO_SHORTS_DISABLED_TXEN_Pos)         | \
                                 (RADIO_SHORTS_DISABLED_RXEN_Enabled << RADIO_SHORTS_DISABLED_RXEN_Pos)         | \
                                 (RADIO_SHORTS_ADDRESS_RSSISTART_Enabled << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) | \
                                 (RADIO_SHORTS_END_START_Enabled << RADIO_SHORTS_END_START_Pos)                 | \
                                 (RADIO_SHORTS_ADDRESS_BCSTART_Enabled << RADIO_SHORTS_ADDRESS_BCSTART_Pos)     | \
                                 (RADIO_SHORTS_DISABLED_RSSISTOP_Enabled << RADIO_SHORTS_DISABLED_RSSISTOP_Pos))

/* To disable all radio shorts */
#define NRF_RADIO_SHORTS_Disabled (0UL)

/*
 * We configure the nrf with a 1 byte S0 field, 8 bits length field, and
 * 0 bit S1 field in normal mode. The preamble is 8 bits long.
 */
#define NRF_LFLEN_Normal         (8UL)
#define NRF_S0LEN_Normal         (1UL)
#define NRF_S1LEN_Normal         (0UL)

/*
 * We configure the nrf with a 1 byte S0 field, 5 bits length field, and
 * 3 bits S1 field in encrypt mode. The preamble is 8 bits long.
 */
#define NRF_LFLEN_Encrypt        (5UL)
#define NRF_S0LEN_Encrypt        (1UL)
#define NRF_S1LEN_Encrypt        (3UL)

/* Clear all events */
#define NRF_EVENTS_Clear        (0UL)

/* Maximum length of frames */
#define NRF_MAXLEN              (37)
#define NRF_STATLEN             (0)
#define NRF_BALEN               (3)     /* For base address of 3 bytes */
#define NRF_RX_START_OFFSET     (5)

/* Access address */
#define NRF_BASE(addr)          ((uint32_t)addr << 8)
#define NRF_PREFIX(addr,offset) (((uint32_t)addr & 0xFF000000) >> offset)
#define NRF_AP0_OFFSET          (24)
#define NRF_AP1_OFFSET          (16)

/* Transmit address select */
#define NRF_TXADDRESS(x)        (x & RADIO_TXADDRESS_TXADDRESS_Msk)

/* Set AAR number of identity root keys */
#define NRF_NIRK_Number(x)      (x & AAR_NIRK_NIRK_Msk)

/* Radio channel frequency */
#define NRF_FREQUENCY(freq)     (((freq) - 2400) & RADIO_FREQUENCY_FREQUENCY_Msk)

/* Maximum tx power */
#define NRF_TX_PWR_MAX_DBM      (4)
#define NRF_TX_PWR_MIN_DBM      (-40)

/* Max. encrypted payload length */
#define NRF_MAX_ENCRYPTED_PYLD_LEN  (27)
#define NRF_ENC_HDR_SIZE            (3)
#define NRF_ENC_BUF_SIZE            \
    (NRF_MAX_ENCRYPTED_PYLD_LEN + NRF_ENC_HDR_SIZE + BLE_LL_DATA_MIC_LEN)

/* BLE PHY data structure */
struct ble_phy_obj
{
    uint8_t phy_stats_initialized;
    int8_t  phy_txpwr_dbm;
    uint8_t phy_chan;
    uint8_t phy_state;
    uint8_t phy_transition;
    uint8_t phy_rx_started;
    uint8_t phy_encrypted;
    uint8_t phy_privacy;
    uint8_t phy_tx_pyld_len;
    uint8_t *rxdptr;
    uint32_t phy_aar_scratch;
    uint32_t phy_access_address;
    struct ble_mbuf_hdr rxhdr;
    void *txend_arg;
    ble_phy_tx_end_func txend_cb;
};
struct ble_phy_obj g_ble_phy_data;

/* XXX: if 27 byte packets desired we can make this smaller */
/* Global transmit/receive buffer */
static uint32_t g_ble_phy_tx_buf[(BLE_PHY_MAX_PDU_LEN + 3) / 4];
static uint32_t g_ble_phy_rx_buf[(BLE_PHY_MAX_PDU_LEN + 3) / 4];

#if (BLE_LL_CFG_FEAT_LE_ENCRYPTION == 1)
/* Make sure word-aligned for faster copies */
static uint32_t g_ble_phy_enc_buf[(NRF_ENC_BUF_SIZE + 3) / 4];
#endif

/* Statistics */
struct stats_ble_phy_stats {
    struct stats_hdr s_hdr;
    STATS_SECT_ENTRY(phy_isrs)
    STATS_SECT_ENTRY(tx_good)
    STATS_SECT_ENTRY(tx_fail)
    STATS_SECT_ENTRY(tx_late)
    STATS_SECT_ENTRY(tx_bytes)
    STATS_SECT_ENTRY(rx_starts)
    STATS_SECT_ENTRY(rx_aborts)
    STATS_SECT_ENTRY(rx_valid)
    STATS_SECT_ENTRY(rx_crc_err)
    STATS_SECT_ENTRY(rx_late)
    STATS_SECT_ENTRY(radio_state_errs)
    STATS_SECT_ENTRY(rx_hw_err)
    STATS_SECT_ENTRY(tx_hw_err)
};
struct stats_ble_phy_stats STATS_VARIABLE(ble_phy_stats);

struct stats_name_map STATS_NAME_MAP_NAME(ble_phy_stats)[] = {
    STATS_NAME(ble_phy_stats, phy_isrs)
    STATS_NAME(ble_phy_stats, tx_good)
    STATS_NAME(ble_phy_stats, tx_fail)
    STATS_NAME(ble_phy_stats, tx_late)
    STATS_NAME(ble_phy_stats, tx_bytes)
    STATS_NAME(ble_phy_stats, rx_starts)
    STATS_NAME(ble_phy_stats, rx_aborts)
    STATS_NAME(ble_phy_stats, rx_valid)
    STATS_NAME(ble_phy_stats, rx_crc_err)
    STATS_NAME(ble_phy_stats, rx_late)
    STATS_NAME(ble_phy_stats, radio_state_errs)
    STATS_NAME(ble_phy_stats, rx_hw_err)
    STATS_NAME(ble_phy_stats, tx_hw_err)
};

