venkatarajasekhar/nRF5_SDK/external/nimble/drivers/nrf51/src/ble_phy.c
    return 0;
}

/**
 * Puts the phy into receive mode.
 *
 * @return int 0: success; BLE Phy error code otherwise
 */
int
ble_phy_rx(void)
{
    /* Check radio state */
    nrf_wait_disabled();
    if (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled) {
        ble_phy_disable();
        STATS_INC(ble_phy_stats, radio_state_errs);
        return BLE_PHY_ERR_RADIO_STATE;
    }

    /* Make sure all interrupts are disabled */
    NRF_RADIO->INTENCLR = NRF_RADIO_IRQ_MASK_ALL;

    /* Clear events prior to enabling receive */
    NRF_RADIO->EVENTS_END = NRF_EVENTS_Clear;
    NRF_RADIO->EVENTS_DISABLED = NRF_EVENTS_Clear;

    /* Setup for rx */
    ble_phy_rx_xcvr_setup();

    /* Start the receive task in the radio if not automatically going to rx */
    if ((NRF_PPI->CHEN & PPI_CHEN_CH21_Msk) == PPI_CHEN_CH21_Disabled) {
        NRF_RADIO->TASKS_RXEN = 1;
    }

    ble_ll_log(BLE_LL_LOG_ID_PHY_RX, g_ble_phy_data.phy_encrypted, 0, 0);

    return 0;
}

#if (BLE_LL_CFG_FEAT_LE_ENCRYPTION == 1)
/**
 * Called to enable encryption at the PHY. Note that this state will persist
 * in the PHY; in other words, if you call this function you have to call
 * disable so that future PHY transmits/receives will not be encrypted.
 *
 * @param pkt_counter
 * @param iv
 * @param key
 * @param is_master
 */
void
ble_phy_encrypt_enable(uint64_t pkt_counter, uint8_t *iv, uint8_t *key,
                       uint8_t is_master)
{
    memcpy(g_nrf_ccm_data.key, key, 16);
    g_nrf_ccm_data.pkt_counter = pkt_counter;
    memcpy(g_nrf_ccm_data.iv, iv, 8);
    g_nrf_ccm_data.dir_bit = is_master;
    g_ble_phy_data.phy_encrypted = 1;

    /* Encryption uses LFLEN = 5, S1LEN = 3. */
    NRF_RADIO->PCNF0 = (NRF_LFLEN_Encrypt << RADIO_PCNF0_LFLEN_Pos) |
                       (NRF_S0LEN_Encrypt << RADIO_PCNF0_S0LEN_Pos) |
                       (NRF_S1LEN_Encrypt << RADIO_PCNF0_S1LEN_Pos);

    /* Enable the module (AAR cannot be on while CCM on) */
    NRF_AAR->ENABLE = AAR_ENABLE_ENABLE_Disabled << AAR_ENABLE_ENABLE_Pos;
    NRF_CCM->ENABLE = CCM_ENABLE_ENABLE_Enabled << CCM_ENABLE_ENABLE_Pos;
}

void
ble_phy_encrypt_set_pkt_cntr(uint64_t pkt_counter, int dir)
{
    g_nrf_ccm_data.pkt_counter = pkt_counter;
    g_nrf_ccm_data.dir_bit = dir;
}

void
ble_phy_encrypt_disable(void)
{
    NRF_PPI->CHENCLR = (PPI_CHEN_CH24_Msk | PPI_CHEN_CH25_Msk);
    NRF_CCM->TASKS_STOP = 1;
    NRF_CCM->EVENTS_ERROR = NRF_EVENTS_Clear;
    NRF_CCM->ENABLE = CCM_ENABLE_ENABLE_Disabled << CCM_ENABLE_ENABLE_Pos;

    /* Switch back to normal length */
    NRF_RADIO->PCNF0 = (NRF_LFLEN_Normal << RADIO_PCNF0_LFLEN_Pos) |
                       (NRF_S0LEN_Normal << RADIO_PCNF0_S0LEN_Pos) |
                       (NRF_S1LEN_Normal << RADIO_PCNF0_S1LEN_Pos);

    g_ble_phy_data.phy_encrypted = 0;
}
#endif

void
ble_phy_set_txend_cb(ble_phy_tx_end_func txend_cb, void *arg)
{
    /* Set transmit end callback and arg */
    g_ble_phy_data.txend_cb = txend_cb;
    g_ble_phy_data.txend_arg = arg;
}

/**
 * Called to set the start time of a transmission.
 *
 * This function is called to set the start time when we are not going from
 * rx to tx automatically.
 *
 * NOTE: care must be taken when calling this function. The channel should
 * already be set.
 *
 * @param cputime
 *
 * @return int
 */
int
ble_phy_tx_set_start_time(uint32_t cputime)
{
    int rc;

    NRF_TIMER0->CC[0] = cputime;
    nrf_ppi_channel_enable(NRF_PPI_CHANNEL20);
    nrf_ppi_channel_disable(NRF_PPI_CHANNEL21);
    if ((int32_t)(cputime_get32() - cputime) >= 0) {
        STATS_INC(ble_phy_stats, tx_late);
        ble_phy_disable();
        rc = BLE_PHY_ERR_TX_LATE;
    } else {
        rc = 0;
    }
    return rc;
}

/**
 * Called to set the start time of a reception
 *
 * This function acts a bit differently than transmit. If we are late getting
 * here we will still attempt to receive.
 *
 * NOTE: care must be taken when calling this function. The channel should
 * already be set.
 *
 * @param cputime
 *
 * @return int
 */
int
ble_phy_rx_set_start_time(uint32_t cputime)
{
    int rc;

    NRF_TIMER0->CC[0] = cputime;
    nrf_ppi_channel_disable(NRF_PPI_CHANNEL20);
    nrf_ppi_channel_enable(NRF_PPI_CHANNEL21);
    if ((int32_t)(cputime_get32() - cputime) >= 0) {
        STATS_INC(ble_phy_stats, rx_late);
        nrf_ppi_channel_disable(NRF_PPI_CHANNEL21);
        NRF_RADIO->TASKS_RXEN = 1;
        rc = BLE_PHY_ERR_TX_LATE;
    } else {
        rc = 0;
    }
    return rc;
}

int
ble_phy_tx(struct os_mbuf *txpdu, uint8_t end_trans)
{
    int rc;
    uint8_t *dptr;
    uint8_t payload_len;
    uint32_t state;
    uint32_t shortcuts;
    struct ble_mbuf_hdr *ble_hdr;

    /* Better have a pdu! */
    assert(txpdu != NULL);

    /*
     * This check is to make sure that the radio is not in a state where
     * it is moving to disabled state. If so, let it get there.
     */
    nrf_wait_disabled();

    ble_hdr = BLE_MBUF_HDR_PTR(txpdu);
    payload_len = ble_hdr->txinfo.pyld_len;

#if (BLE_LL_CFG_FEAT_LE_ENCRYPTION == 1)
    if (g_ble_phy_data.phy_encrypted) {
        /* RAM representation has S0, LENGTH and S1 fields. (3 bytes) */
        dptr = (uint8_t *)&g_ble_phy_enc_buf[0];
        dptr[0] = ble_hdr->txinfo.hdr_byte;
        dptr[1] = payload_len;
        dptr[2] = 0;
        dptr += 3;

        NRF_CCM->SHORTS = CCM_SHORTS_ENDKSGEN_CRYPT_Enabled << CCM_SHORTS_ENDKSGEN_CRYPT_Pos;
        NRF_CCM->INPTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->OUTPTR = (uint32_t)&g_ble_phy_tx_buf[0];
        NRF_CCM->SCRATCHPTR = (uint32_t)&g_nrf_encrypt_scratchpad[0];
        NRF_CCM->EVENTS_ERROR = NRF_EVENTS_Clear;
        NRF_CCM->MODE = CCM_MODE_MODE_Encryption << CCM_MODE_MODE_Pos;
        NRF_CCM->CNFPTR = (uint32_t)&g_nrf_ccm_data;
        nrf_ppi_channel_disable(NRF_PPI_CHANNEL23);
        nrf_ppi_channel_disable(NRF_PPI_CHANNEL25);
        nrf_ppi_channel_enable(NRF_PPI_CHANNEL24);
    } else {

#if (BLE_LL_CFG_FEAT_LL_PRIVACY == 1)
        /* Reconfigure PCNF0 */
        NRF_RADIO->PCNF0 = (NRF_LFLEN_Normal << RADIO_PCNF0_LFLEN_Pos) |
                           (NRF_S0LEN_Normal << RADIO_PCNF0_S0LEN_Pos) |
                           (NRF_S1LEN_Normal << RADIO_PCNF0_S1LEN_Pos);
        nrf_ppi_channel_disable(NRF_PPI_CHANNEL23);
        NRF_AAR->IRKPTR = (uint32_t)&g_nrf_irk_list[0];
#endif
        /* RAM representation has S0 and LENGTH fields (2 bytes) */
        dptr = (uint8_t *)&g_ble_phy_tx_buf[0];
        dptr[0] = ble_hdr->txinfo.hdr_byte;
        dptr[1] = payload_len;
        dptr += 2;
    }
#else

#if (BLE_LL_CFG_FEAT_LL_PRIVACY == 1)
    /* Reconfigure PCNF0 */
    NRF_RADIO->PCNF0 = (NRF_LFLEN_Normal << RADIO_PCNF0_LFLEN_Pos) |
                       (NRF_S0LEN_Normal << RADIO_PCNF0_S0LEN_Pos) |
                       (NRF_S1LEN_Normal << RADIO_PCNF0_S1LEN_Pos);
    nrf_ppi_channel_disable(NRF_PPI_CHANNEL23);
#endif

    /* RAM representation has S0 and LENGTH fields (2 bytes) */
    dptr = (uint8_t *)&g_ble_phy_tx_buf[0];
    dptr[0] = ble_hdr->txinfo.hdr_byte;
    dptr[1] = payload_len;
    dptr += 2;
#endif

    NRF_RADIO->PACKETPTR = (uint32_t)&g_ble_phy_tx_buf[0];

    /* Clear the ready, end and disabled events */
    NRF_RADIO->EVENTS_READY = NRF_EVENTS_Clear;
    NRF_RADIO->EVENTS_END = NRF_EVENTS_Clear;
    NRF_RADIO->EVENTS_DISABLED = NRF_EVENTS_Clear;

